Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_norflash.c
	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_wait_bus_busy
 *
 * Description:
 *   Check if bus is busy and wait until exiting busy
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_wait_bus_busy(FLEXSPI_Type *base)
{
	/* Wait status ready. */
	bool isBusy;
	uint32_t readValue;
	status_t status;
	flexspi_transfer_t flashXfer;

	flashXfer.deviceAddress = 0;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Read;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_READSTATUSREG;
	flashXfer.data = &readValue;
	flashXfer.dataSize = 1;

	do {
		status = imxrt_flexspi_transferblocking(base, &flashXfer);

		if (status != kStatus_Success) {
			return status;
		}
		if (FLASH_BUSY_STATUS_POL) {
			if (readValue & (1U << FLASH_BUSY_STATUS_OFFSET)) {
				isBusy = true;
			} else {
				isBusy = false;
			}
		} else {
			if (readValue & (1U << FLASH_BUSY_STATUS_OFFSET)) {
				isBusy = false;
			} else {
				isBusy = true;
			}
		}

	} while (isBusy);

	return status;
}

status_t imxrt_flexspi_nor_enable_quad_mode(FLEXSPI_Type *base)
{
	flexspi_transfer_t flashXfer;
	status_t status;
	uint32_t writeValue = 0x40;
	irqstate_t flags;

	flags = irqsave();

	/* Write enable */
	status = imxrt_flexspi_nor_write_enable(base, 0);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	/* Enable quad mode. */
	flashXfer.deviceAddress = 0;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Write;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_WRITESTATUSREG;
	flashXfer.data = &writeValue;
	flashXfer.dataSize = 1;

	status = imxrt_flexspi_transferblocking(base, &flashXfer);
	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(base);
	irqrestore(flags);

	return status;
}

/************************************************************************************
 *
 * Description:
 *   Get vendor id in nor flash
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_get_vendor_id(FLEXSPI_Type *base, uint8_t *vendorId)
{
	uint32_t temp;
	flexspi_transfer_t flashXfer;
	flashXfer.deviceAddress = 0;
	flashXfer.port = kFLEXSPI_PortB1;
	flashXfer.cmdType = kFLEXSPI_Read;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_READID;
	flashXfer.data = &temp;
	flashXfer.dataSize = 1;

	status_t status = imxrt_flexspi_transferblocking(base, &flashXfer);

	*vendorId = temp;

	return status;
}

/************************************************************************************
 * Name: flexspi_pins_init
 *
 * Description:
 *   Initialize pin setting in flexspi
 *
 ************************************************************************************/
static inline void flexspi_pins_init(void)
{
#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	imxrt_clock_enableclock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS,     /* GPIO_SD_B1_05 is configured as FLEXSPI_A_DQS */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_05 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_06_FLEXSPI_A_DATA03,  /* GPIO_SD_B1_06 is configured as FLEXSPI_A_DATA03 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_06 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_07_FLEXSPI_A_SCLK,    /* GPIO_SD_B1_07 is configured as FLEXSPI_A_SCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_07 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_08_FLEXSPI_A_DATA00,  /* GPIO_SD_B1_08 is configured as FLEXSPI_A_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_08 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_09_FLEXSPI_A_DATA02,  /* GPIO_SD_B1_09 is configured as FLEXSPI_A_DATA02 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_09 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_10_FLEXSPI_A_DATA01,  /* GPIO_SD_B1_10 is configured as FLEXSPI_A_DATA01 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_10 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_11_FLEXSPI_A_SS0_B,   /* GPIO_SD_B1_11 is configured as FLEXSPI_A_SS0_B */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_11 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_05_FLEXSPI_A_DQS,     /* GPIO_SD_B1_05 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_06_FLEXSPI_A_DATA03,  /* GPIO_SD_B1_06 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_07_FLEXSPI_A_SCLK,    /* GPIO_SD_B1_07 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_08_FLEXSPI_A_DATA00,  /* GPIO_SD_B1_08 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_09_FLEXSPI_A_DATA02,  /* GPIO_SD_B1_09 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_10_FLEXSPI_A_DATA01,  /* GPIO_SD_B1_10 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_11_FLEXSPI_A_SS0_B,   /* GPIO_SD_B1_11 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	imxrt_clock_enableclock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03,   /* GPIO_SD_B1_00 is configured as FLEXSPIB_DATA03 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_00 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02,   /* GPIO_SD_B1_01 is configured as FLEXSPIB_DATA02 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_01 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01,   /* GPIO_SD_B1_02 is configured as FLEXSPIB_DATA01 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_02 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00,   /* GPIO_SD_B1_03 is configured as FLEXSPIB_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_03 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK,     /* GPIO_SD_B1_04 is configured as FLEXSPIB_SCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_04 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 is configured as FLEXSPIA_DQS */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_05 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 is configured as FLEXSPIA_SS0_B */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_06 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 is configured as FLEXSPIA_SCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_07 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 is configured as FLEXSPIA_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_08 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 is configured as FLEXSPIA_DATA01 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_09 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 is configured as FLEXSPIA_DATA02 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_10 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 is configured as FLEXSPIA_DATA03 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_11 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_00_FLEXSPIB_DATA03,   /* GPIO_SD_B1_00 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_01_FLEXSPIB_DATA02,   /* GPIO_SD_B1_01 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_02_FLEXSPIB_DATA01,   /* GPIO_SD_B1_02 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_03_FLEXSPIB_DATA00,   /* GPIO_SD_B1_03 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_04_FLEXSPIB_SCLK,     /* GPIO_SD_B1_04 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 PAD functional properties : */
		0x0130F1u);                             /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Pull
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Enabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * MCR0 Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 PAD functional properties : */
		0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: max(200MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	#endif
}

/************************************************************************************
 * Name: flexspi_clock_init
 *
 * Description:
 *   Initialize clock setting in flexspi
 *
 ************************************************************************************/
static inline void flexspi_clock_init(void)
{
	const clock_usb_pll_config_t g_ccmConfigUsbPll = {.loopDivider = 0U};

