Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_norflash.c
	imxrt_clock_initusb1pll(&g_ccmConfigUsbPll);
	imxrt_clock_initusb1pfd(kCLOCK_Pfd0, 24);   /* Set PLL3 PFD0 clock 360MHZ. */
	imxrt_clock_setmux(kCLOCK_FlexspiMux, 0x3); /* Choose PLL3 PFD0 clock as flexspi source clock. */
	imxrt_clock_setdiv(kCLOCK_FlexspiDiv, 2);   /* flexspi clock 120M. */
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
#if !defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
/************************************************************************************
 * Name: imxrt_flexspi_nor_hyperbus_read
 *
 * Description:
 *   Check if bus is busy and wait until exiting busy
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_hyperbus_read(FLEXSPI_Type *base, uint32_t addr, uint32_t *buffer, uint32_t bytes)
{
	flexspi_transfer_t flashXfer;
	status_t status;

	flashXfer.deviceAddress = addr * 2;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Read;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_READ_FAST;
	flashXfer.data = buffer;
	flashXfer.dataSize = bytes;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		return status;
	}

	return status;
}
#endif


/************************************************************************************
 * Name: up_dumptoflash
 *
 * Description:
 *   Wrapper function for flexispi write call
 *
 ************************************************************************************/
#if defined(CONFIG_BOARD_CRASHDUMP)
uint32_t up_dumptoflash(uint32_t addr, uint32_t *buffer, uint32_t bytes)
{
	return imxrt_flexspi_nor_flash_page_program(IMXRT_FLEXSPI, addr, (void *)buffer);
}
#endif

/************************************************************************************
 * Name: imxrt_flexspi_nor_flash_erase_sector
 *
 * Description:
 *   Erase data to hyper flash using flexspi interface
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_flash_erase_sector(FLEXSPI_Type *base, uint32_t address)
{
	status_t status;
	flexspi_transfer_t flashXfer;
	irqstate_t flags;

	flags = irqsave();

	/* Write enable */
	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Command;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_WRITEENABLE;

	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Command;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_ERASESECTOR;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(base);

	arch_invalidate_dcache(address + IMXRT_FLASH_BASE, address + IMXRT_FLASH_BASE + IMXRT_SECTOR_SIZE);

	irqrestore(flags);

	return status;
}

/************************************************************************************
 * Name: imxrt_flexspi_nor_flash_page_program
 *
 * Description:
 *   Write data to hyper flash using flexspi interface
 *
 ************************************************************************************/
status_t imxrt_flexspi_nor_flash_page_program(FLEXSPI_Type *base, uint32_t address, const uint32_t *src)
{
	status_t status;
	flexspi_transfer_t flashXfer;
	irqstate_t flags;

	flags = irqsave();

	/* Write enable */
	status = imxrt_flexspi_nor_write_enable(base, address);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	/* Prepare page program command */
	flashXfer.deviceAddress = address;
	flashXfer.port = kFLEXSPI_PortA1;
	flashXfer.cmdType = kFLEXSPI_Write;
	flashXfer.SeqNumber = 1;
	flashXfer.seqIndex = NOR_CMD_LUT_SEQ_IDX_PAGEPROGRAM_QUAD;
	flashXfer.data = (uint32_t *)src;
	flashXfer.dataSize = IMXRT_FLASH_PAGE_SIZE;
	status = imxrt_flexspi_transferblocking(base, &flashXfer);

	if (status != kStatus_Success) {
		irqrestore(flags);
		return status;
	}

	status = imxrt_flexspi_nor_wait_bus_busy(base);

	arch_flush_dcache(address + IMXRT_FLASH_BASE, address + IMXRT_FLASH_BASE + IMXRT_FLASH_PAGE_SIZE);
	irqrestore(flags);

	return status;
}


#ifdef CONFIG_MTD_PROGMEM
size_t up_progmem_pagesize(size_t page)
{
	printf("up_progmem_pagesize\n");
	return IMXRT_FLASH_PAGE_SIZE;
}

size_t up_progmem_blocksize(void)
{
	printf("up_progmem_blocksize\n");
	return IMXRT_BLOCK_SIZE;
}

ssize_t up_progmem_getpage(size_t addr)
{
	printf("up_progmem_getpage\n");

	if (addr < IMXRT_FLASH_BASE) {
		return 0;
	}

	if (addr >= IMXRT_FLASH_TOTAL_SIZE) {
		return -EFAULT;
	}

	return addr / IMXRT_FLASH_PAGE_SIZE;
}

size_t up_progmem_getaddress(size_t page)
{
	printf("up_progmem_getaddress\n");

	if (page >= (IMXRT_FLASH_TOTAL_SIZE/IMXRT_FLASH_PAGE_SIZE)) {
		return SIZE_MAX;
	}

	return page * IMXRT_FLASH_PAGE_SIZE + IMXRT_FLASH_BASE;
}

size_t up_progmem_npages(void)
{
	printf("up_progmem_npages\n");

	return (IMXRT_FLASH_TOTAL_SIZE/IMXRT_FLASH_PAGE_SIZE);
}

bool up_progmem_isuniform(void)
{
	printf("up_progmem_isuniform\n");
	return false;
}

ssize_t up_progmem_erasepage(size_t page)
{
	uint32_t address;

	printf("up_progmem_erasepage\n");

	address = up_progmem_getaddress(page);

	return imxrt_flexspi_nor_flash_erase_sector(IMXRT_FLEXSPI, address);
}

ssize_t up_progmem_ispageerased(size_t page)
{
	size_t addr;
	size_t count;
	size_t bwritten = 0;

	printf("up_progmem_erasepage\n");

	if (page >= IMXRT_FLASH_PAGE_SIZE) {
		return -EFAULT;
	}

	/* Verify */

	for (addr = up_progmem_getaddress(page), count = up_progmem_pagesize(page); count; count--, addr++) {
		if (getreg8(addr) != 0xff) {
			bwritten++;
		}
	}

	return bwritten;
}

ssize_t up_progmem_write(size_t addr, const void *buf, size_t count)
{
	printf("up_progmem_write\n");

