Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_norflash.c
	return 0;
}
#else
/************************************************************************************
 * Name: up_flashinitialize
 *
 * Description:
 *   Return an initialize MTD device instance.  MTD devices are not registered
 *   in the file system, but are created as instances that can be bound to
 *   other functions (such as a block or character driver front end).
 *
 ************************************************************************************/
FAR struct mtd_dev_s *up_flashinitialize(void)
{
	return (FAR struct mtd_dev_s *)imxrt_mtd_initialize();
}
#endif

/************************************************************************************
 * Name: imxrt_flash_init
 *
 * Description:
 *   Initialize flash 
 *
 ************************************************************************************/
void imxrt_flash_init(void)
{
	flexspi_config_t config;
	status_t status;

	flexspi_pins_init();
	flexspi_clock_init();

	/*Get FLEXSPI default settings and configure the flexspi. */
	imxrt_flexspi_getdefaultconfig(&config);

	/*Set AHB buffer size for reading data through AHB bus. */
	config.ahbConfig.enableAHBPrefetch = true;
	config.ahbConfig.enableAHBBufferable = true;
	config.ahbConfig.enableReadAddressOpt = true;
	config.ahbConfig.enableAHBCachable = true;
	config.rxSampleClock = kFLEXSPI_ReadSampleClkLoopbackFromDqsPad;
	imxrt_flexspi_init(IMXRT_FLEXSPI, &config);

	/* Configure flash settings according to serial flash feature. */
	imxrt_flexspi_setflashconfig(IMXRT_FLEXSPI, &deviceconfig, kFLEXSPI_PortA1);

	/* Update LUT table. */
	imxrt_flexspi_updatelut(IMXRT_FLEXSPI, 0, customLUT, CUSTOM_LUT_LENGTH);

	/* Do software reset. */
	imxrt_flexspi_softwarereset(IMXRT_FLEXSPI);
}

